; Korean language file v3.9.0
; Author: bursoft (Translated by Gemini, console alignment fixed)
; In the codepage key must be specified code page number for this language (eg 1251 for the Russian, 1253 for the Greek, and so on).
bat_lang=ko
codepage=949
error=오류^!
startup_error1=Batch ApkTool이 폴더에 대한 전체 액세스 권한이 없거나 설치 경로에 잘못된 문자가 포함되어 있습니다.
startup_error2=Batch ApkTool이 폴더에 쓸 수 있는 권한이 없습니다.
previous_java1=Java가 설치되어 있습니다.
previous_java2=Batch ApkTool은 Java 8 이상에서만 제대로 작동합니다.
get_java=여기서 최신 Java를 다운로드하세요: https://www.java.com/en/download/
java_notfound=Java를 찾을 수 없습니다.
ON=예
OFF=아니요
MANUAL=수동
project=현재 프로젝트                               
currentapk=선택된 APK                                  
currentjar=선택된 JAR                                  
apilevel=API 수준                                  
keepbroken=손상된 리소스 유지                        
buildexpert=전문가(EXPERT) 모드로 빌드                                           
dontwritedebug=smali에 디버그 정보 포함하지 않음           
signafter=출력 APK 서명                               
key=서명 키                                   
openlog=로그 열기                                                             
language=언어                                        
deodexall=모든 APK 및 JAR 디오덱스(Deodex)            
copy_deodexed_apk=디오덱스된 APK를 _INPUT_APK로 복사          
copy_deodexed_jar=디오덱스된 JAR을 _INPUT_JAR로 복사          
baksmaliapk=APK 디컴파일 (smali만)
smaliapk=APK 리컴파일
baksmalijar=JAR 디컴파일 (smali만)
smalijar=JAR 리컴파일
decompile=APK 디컴파일                                
decompile_r=APK 디컴파일 (리소스만)                     
recompile=APK 리컴파일                                
signfiles=파일 서명
zipalfiles=파일 Zipalign
viewsource=Java 소스 코드 보기
plugins=플러그인 >
selplugin=플러그인 선택:
adbmenu=ADB:
devices=기기                                        
install=설치 >                                      
rootremount=루트, 리마운트(root, remount)               
pull=가져오기(pull) >                            
push=밀어넣기(push) >                            
screenshot=스크린샷                                    
screenrecord=화면 녹화
shell=쉘(shell)
logs=로그 >
reboot=재부팅 >
info=정보
kill-server=서버 종료(kill-server)
servicemenu=서비스:
cleanup1=_framework, _system 정리                    
cleanup2=_INPUT_APK, _INPUT_JAR 정리                 
cleanup3=_OUT_APK, _OUT_JAR 정리      
cleanup4=모든 폴더 정리
exitmenu=종료
choosetask=작업을 선택하세요:
instframe=프레임워크 설치 중
instframe_error=프레임워크 설치 오류
inputapk_empty=디컴파일할 파일을 _INPUT_APK 폴더에 넣으세요. 자세한 내용은 readme.txt를 참조하세요.
decompiling=디컴파일 중
decompiling_error=디컴파일 오류
recompiling=리컴파일 중
recompiling_error=리컴파일 오류
orignotfound=오류. 원본 파일을 찾을 수 없습니다.
backupnotfound=오류. _backup 폴더를 찾을 수 없습니다.
done=완료
signing=서명 중
signing_error=서명 오류
doneerrors=^!error_count^!개의 오류와 함께 완료되었습니다.
zipal=Zipalign 진행 중
zipal_error=Zipalign 오류
selectviewer=Java 소스 코드 뷰어 선택:
cancel=취소
makechoice=선택해 주세요:
dragajd=APK, JAR 또는 DEX 파일을 여기로 드래그하세요:
genjava=다음에서 Java 코드 생성 중:
genjava_error=다음에서 Java 코드 생성 오류:
apilevel_log=API 수준                    
buildexpert_log=전문가(EXPERT) 모드로 빌드  
signafter_log=출력 APK 서명               
press1=계속하려면 ENTER를 누르고 로그를 열려면 1을 입력하세요:
deletedialog=다음 폴더의 모든 파일 삭제:
proceed=계속하시겠습니까?
yes=예
selproj=프로젝트 선택:
createnewproj=새 프로젝트 만들기
usedefproj=기본 프로젝트 사용
inputprojname=프로젝트 이름 입력:
selectapk=APK 선택:
allapks=_INPUT_APK의 모든 APK
selectjar=JAR 선택:
alljars=_INPUT_JAR의 모든 JAR
selectapktool=APKTOOL 선택:
selectsmali=SMALI 선택:
aversions=Android 버전
apilevels=API 수준       
enterapi=API 수준 입력:
invalidapi=잘못된 API 수준입니다^!
selectkey=키 선택:
selectlang=언어 선택:
framework_empty=모든 프레임워크 파일을 _system\framework 폴더에 넣으세요. 자세한 내용은 readme.txt를 참조하세요.
deodexing=디오덱스(Deodex) 중
notodexed=파일이 오덱스(odex)되지 않았습니다.
smerror=Smali 변환 오류
bsmerror=Baksmali 변환 오류
bootnotfound=boot.oat를 찾을 수 없습니다.
selectarch=boot.oat 아키텍처 선택:
selectedarch=아키텍처
extractboot=boot.oat 추출 및 디오덱스 중...
extractboot_error=boot.oat 추출 오류
errorunp=압축 해제 오류
deodexing_error=디오덱스 오류
baksmaling=Baksmali 진행 중
smaling=Smali 진행 중
connection_type=연결 유형:
input_ip=기기 IP 및 포트 입력 (예: 192.168.1.3:40404):
input_ip2=기기 IP를 입력하거나 ENTER를 눌러 마지막 IP를 사용하세요:
installtodef=기본 메모리에 설치:
singlefile=단일 파일
allfrom=다음의 모든 파일:
installtosd=SD 카드에 설치:
dragtoinstall=설치할 APK를 여기로 드래그하세요:
installing=설치 중
pull2=가져오기(Pull):
pushto=밀어넣기(Push):
dragtopush=밀어넣을 파일을 여기로 드래그하세요:
screensavedto=스크린샷이 다음 파일에 저장되었습니다:
closetostop=녹화를 중지하려면 이 창을 닫으세요
scrrecsavedto=화면 녹화가 다음 파일에 저장되었습니다:
logcatr=라디오(radio)
logcate=이벤트(events)
toscreen=화면에 표시 및 파일에 저장
tofile=파일에 저장
bugreport=버그 리포트:
inlinetable=인라인 메서드 테이블:
saved_to_file=로그가 파일에 저장되었습니다
android_version=Android 버전:
brand=브랜드:
model=모델:
reboot2=재부팅:
reboot3=재부팅
rebootto=다음으로 재부팅:
symlinks=심볼릭 링크(SYMLINKS)
copied_files=복사된 파일:
old_smali_used=디오덱스하려면 smali 2.2 이상을 선택하세요
already_deodexed=파일이 이미 디오덱스되었습니다.
onefrom=다음 중 하나의 파일:
alt_method=대체 방법
tool_for_deodex=Android 6.x-7.x 디오덱스 도구                                         
del_symlinks=디오덱스 후 심볼릭 링크 삭제                                          
rewrite_opt=디컴파일 전 폴더 덮어쓰기 경고                                        
warn_rewrite1=디컴파일된 애플리케이션이 있는 폴더를 찾았습니다.
warn_rewrite2=폴더를 덮어쓰려면 1을 입력하고 취소하려면 ENTER를 누르세요:
sound_opt=소리 알림                                                             
manifest_opt=원본 AndroidManifest.xml 저장                                         
AUTO=자동
AUTO+=자동+
necessary_files_missing=하나 이상의 필수 파일이 누락되어 Batch ApkTool의 추가 작업을 수행할 수 없습니다.
dex_notfound=파일에 classes.dex가 포함되어 있지 않습니다. 디컴파일하기 전에 디오덱스해야 합니다.
elapsed_time=경과 시간
elapsed_h=시간
elapsed_m=분
elapsed_s=초
tool_for_deodex_vdex=Android 8.x 디오덱스 도구                                             
device_warning=Android 9.x를 디오덱스하려면 ADB를 통해 기기\에뮬레이터를 연결해야 합니다. 기기를 연결하고(메뉴 항목 [10]) 디오덱스를 다시 시작하세요.
signing_scheme_opt=APK 서명 구성(scheme)                                                 
use_aapt_2=AAPT 버전 (apktool v2.x 전용)                                          
back_to_main_menu=메인 메뉴로 돌아가기
set_postfix=덮어쓰는 대신 출력 파일명에 일련번호 추가                             
dex_compression=.dex 파일 압축 수준                                                    
dex_compression_text=압축 수준을 설정하세요 (0 - 압축 없음, 9 - 최대 압축)
res_mode=리소스 확인 모드                          
force_sign_v1=v1 서명 강제 추가                                                     
produce_v4_sign=v4 서명 파일(.idsig) 추가 생성                                        
enable_expert_mode=전문가(Expert) 모드 활성화                                             
expert_mode_disabled=전문가(Expert) 모드가 비활성화되었습니다.
input_ip3=연결 선택 또는 IP 및 포트 입력
devices_not_found=ADB 기기를 찾을 수 없습니다.
adbcontrol=scrcpy                                      
pullfrom=다음에서 복사:
push2=기기에 밀어넣기(Push)
current_folder=현재 폴더
connect_qr=QR 코드를 사용하여 연결
merge_apks=분할된 APK 병합                             
merging=병합 중
